backend/app/payments/tests/__snapshots__/test_create_session_paid.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer sk_test_jvZ3yrlb77roQiXw6HnSNvXH00VXDVY0G4
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.40.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.40.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.4", "platform": "Linux-4.19.76-linuxkit-x86_64-with",
        "uname": "Linux 8ba19cd280bf 4.19.76-linuxkit #1 SMP Thu Oct 17 19:31:58 UTC
        2019 x86_64 "}'
    method: GET
    uri: https://api.stripe.com/v1/subscriptions/sub_H2mygz39GNb5C1
  response:
    body:
      string: "{\n  \"id\": \"sub_H2mygz39GNb5C1\",\n  \"object\": \"subscription\"\
        ,\n  \"application_fee_percent\": null,\n  \"billing\": \"charge_automatically\"\
        ,\n  \"billing_cycle_anchor\": 1586127396,\n  \"billing_thresholds\": null,\n\
        \  \"cancel_at\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\"\
        : null,\n  \"collection_method\": \"charge_automatically\",\n  \"created\"\
        : 1586127396,\n  \"current_period_end\": 1588719396,\n  \"current_period_start\"\
        : 1586127396,\n  \"customer\": \"cus_H2lvIVaB5erjgo\",\n  \"days_until_due\"\
        : null,\n  \"default_payment_method\": \"pm_1GUhOKHTMy2ngeDKHUyfgotN\",\n\
        \  \"default_source\": null,\n  \"default_tax_rates\": [\n\n  ],\n  \"discount\"\
        : null,\n  \"ended_at\": null,\n  \"invoice_customer_balance_settings\": {\n\
        \    \"consume_applied_balance_on_void\": true\n  },\n  \"items\": {\n   \
        \ \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"si_H2myJChFbk5XXE\"\
        ,\n        \"object\": \"subscription_item\",\n        \"billing_thresholds\"\
        : null,\n        \"created\": 1586127397,\n        \"metadata\": {\n     \
        \   },\n        \"plan\": {\n          \"id\": \"plan_H1Ci4XHaGDHOLy\",\n\
        \          \"object\": \"plan\",\n          \"active\": true,\n          \"\
        aggregate_usage\": null,\n          \"amount\": 799,\n          \"amount_decimal\"\
        : \"799\",\n          \"billing_scheme\": \"per_unit\",\n          \"created\"\
        : 1585761906,\n          \"currency\": \"usd\",\n          \"interval\": \"\
        month\",\n          \"interval_count\": 1,\n          \"livemode\": false,\n\
        \          \"metadata\": {\n          },\n          \"nickname\": \"1x/month\"\
        ,\n          \"product\": \"prod_H1CZ5dILCmMJER\",\n          \"tiers\": null,\n\
        \          \"tiers_mode\": null,\n          \"transform_usage\": null,\n \
        \         \"trial_period_days\": null,\n          \"usage_type\": \"licensed\"\
        \n        },\n        \"quantity\": 1,\n        \"subscription\": \"sub_H2mygz39GNb5C1\"\
        ,\n        \"tax_rates\": [\n\n        ]\n      }\n    ],\n    \"has_more\"\
        : false,\n    \"total_count\": 1,\n    \"url\": \"/v1/subscription_items?subscription=sub_H2mygz39GNb5C1\"\
        \n  },\n  \"latest_invoice\": \"in_1GUhOKHTMy2ngeDKBduUCDcm\",\n  \"livemode\"\
        : false,\n  \"metadata\": {\n  },\n  \"next_pending_invoice_item_invoice\"\
        : null,\n  \"pause_collection\": null,\n  \"pending_invoice_item_interval\"\
        : null,\n  \"pending_setup_intent\": null,\n  \"pending_update\": null,\n\
        \  \"plan\": {\n    \"id\": \"plan_H1Ci4XHaGDHOLy\",\n    \"object\": \"plan\"\
        ,\n    \"active\": true,\n    \"aggregate_usage\": null,\n    \"amount\":\
        \ 799,\n    \"amount_decimal\": \"799\",\n    \"billing_scheme\": \"per_unit\"\
        ,\n    \"created\": 1585761906,\n    \"currency\": \"usd\",\n    \"interval\"\
        : \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"\
        metadata\": {\n    },\n    \"nickname\": \"1x/month\",\n    \"product\": \"\
        prod_H1CZ5dILCmMJER\",\n    \"tiers\": null,\n    \"tiers_mode\": null,\n\
        \    \"transform_usage\": null,\n    \"trial_period_days\": null,\n    \"\
        usage_type\": \"licensed\"\n  },\n  \"quantity\": 1,\n  \"schedule\": null,\n\
        \  \"start\": 1586127396,\n  \"start_date\": 1586127396,\n  \"status\": \"\
        active\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\"\
        : null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '2877'
      Content-Type:
      - application/json
      Date:
      - Mon, 06 Apr 2020 04:38:28 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_ARxKOLLlADCvTv
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
version: 1
